TexasInstruments/c2000ware-core-sdk/device_support/f28004x/examples/boostxl_afe031_f28004x_dacmode/boostxl_afe031_f28004x_dacmode_isr.h
#if (G5_7PL >= G5_15PL) || (G5_7PL == 0)
#define  MG5_15_17PL    ~(1 << 6)
#else
#define  MG5_15_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_15PL) || (G5_8PL == 0)
#define  MG5_15_18PL    ~(1 << 7)
#else
#define  MG5_15_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_15PL) || (G5_9PL == 0)
#define  MG5_15_19PL    ~(1 << 8)
#else
#define  MG5_15_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_15PL) || (G5_10PL == 0)
#define  MG5_15_110PL    ~(1 << 9)
#else
#define  MG5_15_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_15PL) || (G5_11PL == 0)
#define  MG5_15_111PL    ~(1 << 10)
#else
#define  MG5_15_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_15PL) || (G5_12PL == 0)
#define  MG5_15_112PL    ~(1 << 11)
#else
#define  MG5_15_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_15PL) || (G5_13PL == 0)
#define  MG5_15_113PL    ~(1 << 12)
#else
#define  MG5_15_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_15PL) || (G5_14PL == 0)
#define  MG5_15_114PL    ~(1 << 13)
#else
#define  MG5_15_114PL    0xFFFF
#endif

#if (G5_16PL >= G5_15PL) || (G5_16PL == 0)
#define  MG5_15_116PL    ~(1 << 15)
#else
#define  MG5_15_116PL    0xFFFF
#endif

#define  MG5_15_115PL	0xBFFF
#define  MG5_15    (MG5_15_11PL & MG5_15_12PL & MG5_15_13PL & MG5_15_14PL & \
                    MG5_15_15PL & MG5_15_16PL & MG5_15_17PL & MG5_15_18PL & \
                    MG5_15_19PL & MG5_15_110PL & MG5_15_111PL & MG5_15_112PL & \
                    MG5_15_113PL & MG5_15_114PL & MG5_15_115PL & MG5_15_116PL)
// End of MG5_15:
// Beginning of MG516:
#if (G5_1PL >= G5_16PL) || (G5_1PL == 0)
#define  MG5_16_11PL    ~(1 << 0)
#else
#define  MG5_16_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_16PL) || (G5_2PL == 0)
#define  MG5_16_12PL    ~(1 << 1)
#else
#define  MG5_16_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_16PL) || (G5_3PL == 0)
#define  MG5_16_13PL    ~(1 << 2)
#else
#define  MG5_16_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_16PL) || (G5_4PL == 0)
#define  MG5_16_14PL    ~(1 << 3)
#else
#define  MG5_16_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_16PL) || (G5_5PL == 0)
#define  MG5_16_15PL    ~(1 << 4)
#else
#define  MG5_16_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_16PL) || (G5_6PL == 0)
#define  MG5_16_16PL    ~(1 << 5)
#else
#define  MG5_16_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_16PL) || (G5_7PL == 0)
#define  MG5_16_17PL    ~(1 << 6)
#else
#define  MG5_16_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_16PL) || (G5_8PL == 0)
#define  MG5_16_18PL    ~(1 << 7)
#else
#define  MG5_16_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_16PL) || (G5_9PL == 0)
#define  MG5_16_19PL    ~(1 << 8)
#else
#define  MG5_16_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_16PL) || (G5_10PL == 0)
#define  MG5_16_110PL    ~(1 << 9)
#else
#define  MG5_16_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_16PL) || (G5_11PL == 0)
#define  MG5_16_111PL    ~(1 << 10)
#else
#define  MG5_16_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_16PL) || (G5_12PL == 0)
#define  MG5_16_112PL    ~(1 << 11)
#else
#define  MG5_16_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_16PL) || (G5_13PL == 0)
#define  MG5_16_113PL    ~(1 << 12)
#else
#define  MG5_16_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_16PL) || (G5_14PL == 0)
#define  MG5_16_114PL    ~(1 << 13)
#else
#define  MG5_16_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_16PL) || (G5_15PL == 0)
#define  MG5_16_115PL    ~(1 << 14)
#else
#define  MG5_16_115PL    0xFFFF
#endif

#define  MG5_16_116PL	0x7FFF
#define  MG5_16    (MG5_16_11PL & MG5_16_12PL & MG5_16_13PL & MG5_16_14PL & \
                    MG5_16_15PL & MG5_16_16PL & MG5_16_17PL & MG5_16_18PL & \
                    MG5_16_19PL & MG5_16_110PL & MG5_16_111PL & MG5_16_112PL & \
                    MG5_16_113PL & MG5_16_114PL & MG5_16_115PL & MG5_16_116PL)
// End of MG5_16:


//
// Automatically generate PIEIER6 interrupt masks MG61 to MG616:
//

// Beginning of MG61:
#if (G6_2PL >= G6_1PL) || (G6_2PL == 0)
#define  MG6_1_12PL    ~(1 << 1)
#else
#define  MG6_1_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_1PL) || (G6_3PL == 0)
#define  MG6_1_13PL    ~(1 << 2)
#else
#define  MG6_1_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_1PL) || (G6_4PL == 0)
#define  MG6_1_14PL    ~(1 << 3)
#else
#define  MG6_1_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_1PL) || (G6_5PL == 0)
#define  MG6_1_15PL    ~(1 << 4)
#else
#define  MG6_1_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_1PL) || (G6_6PL == 0)
#define  MG6_1_16PL    ~(1 << 5)
#else
#define  MG6_1_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_1PL) || (G6_7PL == 0)
#define  MG6_1_17PL    ~(1 << 6)
#else
#define  MG6_1_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_1PL) || (G6_8PL == 0)
#define  MG6_1_18PL    ~(1 << 7)
#else
#define  MG6_1_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_1PL) || (G6_9PL == 0)
#define  MG6_1_19PL    ~(1 << 8)
#else
#define  MG6_1_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_1PL) || (G6_10PL == 0)
#define  MG6_1_110PL    ~(1 << 9)
#else
#define  MG6_1_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_1PL) || (G6_11PL == 0)
#define  MG6_1_111PL    ~(1 << 10)
#else
#define  MG6_1_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_1PL) || (G6_12PL == 0)
#define  MG6_1_112PL    ~(1 << 11)
#else
#define  MG6_1_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_1PL) || (G6_13PL == 0)
#define  MG6_1_113PL    ~(1 << 12)
#else
#define  MG6_1_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_1PL) || (G6_14PL == 0)
#define  MG6_1_114PL    ~(1 << 13)
#else
#define  MG6_1_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_1PL) || (G6_15PL == 0)
#define  MG6_1_115PL    ~(1 << 14)
#else
#define  MG6_1_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_1PL) || (G6_16PL == 0)
#define  MG6_1_116PL    ~(1 << 15)
#else
#define  MG6_1_116PL    0xFFFF
#endif

#define  MG6_1_11PL	0xFFFE
#define  MG6_1    (MG6_1_11PL & MG6_1_12PL & MG6_1_13PL & MG6_1_14PL & \
                    MG6_1_15PL & MG6_1_16PL & MG6_1_17PL & MG6_1_18PL & \
                    MG6_1_19PL & MG6_1_110PL & MG6_1_111PL & MG6_1_112PL & \
                    MG6_1_113PL & MG6_1_114PL & MG6_1_115PL & MG6_1_116PL)
// End of MG6_1:
// Beginning of MG62:
#if (G6_1PL >= G6_2PL) || (G6_1PL == 0)
#define  MG6_2_11PL    ~(1 << 0)
#else
#define  MG6_2_11PL    0xFFFF
#endif

