TexasInstruments/c2000ware-core-sdk/device_support/f28004x/examples/boostxl_afe031_f28004x_dacmode/boostxl_afe031_f28004x_dacmode_isr.h
#if (G6_6PL >= G6_14PL) || (G6_6PL == 0)
#define  MG6_14_16PL    ~(1 << 5)
#else
#define  MG6_14_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_14PL) || (G6_7PL == 0)
#define  MG6_14_17PL    ~(1 << 6)
#else
#define  MG6_14_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_14PL) || (G6_8PL == 0)
#define  MG6_14_18PL    ~(1 << 7)
#else
#define  MG6_14_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_14PL) || (G6_9PL == 0)
#define  MG6_14_19PL    ~(1 << 8)
#else
#define  MG6_14_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_14PL) || (G6_10PL == 0)
#define  MG6_14_110PL    ~(1 << 9)
#else
#define  MG6_14_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_14PL) || (G6_11PL == 0)
#define  MG6_14_111PL    ~(1 << 10)
#else
#define  MG6_14_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_14PL) || (G6_12PL == 0)
#define  MG6_14_112PL    ~(1 << 11)
#else
#define  MG6_14_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_14PL) || (G6_13PL == 0)
#define  MG6_14_113PL    ~(1 << 12)
#else
#define  MG6_14_113PL    0xFFFF
#endif

#if (G6_15PL >= G6_14PL) || (G6_15PL == 0)
#define  MG6_14_115PL    ~(1 << 14)
#else
#define  MG6_14_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_14PL) || (G6_16PL == 0)
#define  MG6_14_116PL    ~(1 << 15)
#else
#define  MG6_14_116PL    0xFFFF
#endif

#define  MG6_14_114PL	0xDFFF
#define  MG6_14    (MG6_14_11PL & MG6_14_12PL & MG6_14_13PL & MG6_14_14PL & \
                    MG6_14_15PL & MG6_14_16PL & MG6_14_17PL & MG6_14_18PL & \
                    MG6_14_19PL & MG6_14_110PL & MG6_14_111PL & MG6_14_112PL & \
                    MG6_14_113PL & MG6_14_114PL & MG6_14_115PL & MG6_14_116PL)
// End of MG6_14:
// Beginning of MG615:
#if (G6_1PL >= G6_15PL) || (G6_1PL == 0)
#define  MG6_15_11PL    ~(1 << 0)
#else
#define  MG6_15_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_15PL) || (G6_2PL == 0)
#define  MG6_15_12PL    ~(1 << 1)
#else
#define  MG6_15_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_15PL) || (G6_3PL == 0)
#define  MG6_15_13PL    ~(1 << 2)
#else
#define  MG6_15_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_15PL) || (G6_4PL == 0)
#define  MG6_15_14PL    ~(1 << 3)
#else
#define  MG6_15_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_15PL) || (G6_5PL == 0)
#define  MG6_15_15PL    ~(1 << 4)
#else
#define  MG6_15_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_15PL) || (G6_6PL == 0)
#define  MG6_15_16PL    ~(1 << 5)
#else
#define  MG6_15_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_15PL) || (G6_7PL == 0)
#define  MG6_15_17PL    ~(1 << 6)
#else
#define  MG6_15_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_15PL) || (G6_8PL == 0)
#define  MG6_15_18PL    ~(1 << 7)
#else
#define  MG6_15_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_15PL) || (G6_9PL == 0)
#define  MG6_15_19PL    ~(1 << 8)
#else
#define  MG6_15_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_15PL) || (G6_10PL == 0)
#define  MG6_15_110PL    ~(1 << 9)
#else
#define  MG6_15_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_15PL) || (G6_11PL == 0)
#define  MG6_15_111PL    ~(1 << 10)
#else
#define  MG6_15_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_15PL) || (G6_12PL == 0)
#define  MG6_15_112PL    ~(1 << 11)
#else
#define  MG6_15_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_15PL) || (G6_13PL == 0)
#define  MG6_15_113PL    ~(1 << 12)
#else
#define  MG6_15_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_15PL) || (G6_14PL == 0)
#define  MG6_15_114PL    ~(1 << 13)
#else
#define  MG6_15_114PL    0xFFFF
#endif

#if (G6_16PL >= G6_15PL) || (G6_16PL == 0)
#define  MG6_15_116PL    ~(1 << 15)
#else
#define  MG6_15_116PL    0xFFFF
#endif

#define  MG6_15_115PL	0xBFFF
#define  MG6_15    (MG6_15_11PL & MG6_15_12PL & MG6_15_13PL & MG6_15_14PL & \
                    MG6_15_15PL & MG6_15_16PL & MG6_15_17PL & MG6_15_18PL & \
                    MG6_15_19PL & MG6_15_110PL & MG6_15_111PL & MG6_15_112PL & \
                    MG6_15_113PL & MG6_15_114PL & MG6_15_115PL & MG6_15_116PL)
// End of MG6_15:
// Beginning of MG616:
#if (G6_1PL >= G6_16PL) || (G6_1PL == 0)
#define  MG6_16_11PL    ~(1 << 0)
#else
#define  MG6_16_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_16PL) || (G6_2PL == 0)
#define  MG6_16_12PL    ~(1 << 1)
#else
#define  MG6_16_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_16PL) || (G6_3PL == 0)
#define  MG6_16_13PL    ~(1 << 2)
#else
#define  MG6_16_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_16PL) || (G6_4PL == 0)
#define  MG6_16_14PL    ~(1 << 3)
#else
#define  MG6_16_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_16PL) || (G6_5PL == 0)
#define  MG6_16_15PL    ~(1 << 4)
#else
#define  MG6_16_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_16PL) || (G6_6PL == 0)
#define  MG6_16_16PL    ~(1 << 5)
#else
#define  MG6_16_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_16PL) || (G6_7PL == 0)
#define  MG6_16_17PL    ~(1 << 6)
#else
#define  MG6_16_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_16PL) || (G6_8PL == 0)
#define  MG6_16_18PL    ~(1 << 7)
#else
#define  MG6_16_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_16PL) || (G6_9PL == 0)
#define  MG6_16_19PL    ~(1 << 8)
#else
#define  MG6_16_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_16PL) || (G6_10PL == 0)
#define  MG6_16_110PL    ~(1 << 9)
#else
#define  MG6_16_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_16PL) || (G6_11PL == 0)
#define  MG6_16_111PL    ~(1 << 10)
#else
#define  MG6_16_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_16PL) || (G6_12PL == 0)
#define  MG6_16_112PL    ~(1 << 11)
#else
#define  MG6_16_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_16PL) || (G6_13PL == 0)
#define  MG6_16_113PL    ~(1 << 12)
#else
#define  MG6_16_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_16PL) || (G6_14PL == 0)
#define  MG6_16_114PL    ~(1 << 13)
#else
#define  MG6_16_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_16PL) || (G6_15PL == 0)
#define  MG6_16_115PL    ~(1 << 14)
#else
#define  MG6_16_115PL    0xFFFF
#endif

#define  MG6_16_116PL	0x7FFF
#define  MG6_16    (MG6_16_11PL & MG6_16_12PL & MG6_16_13PL & MG6_16_14PL & \
                    MG6_16_15PL & MG6_16_16PL & MG6_16_17PL & MG6_16_18PL & \
                    MG6_16_19PL & MG6_16_110PL & MG6_16_111PL & MG6_16_112PL & \
                    MG6_16_113PL & MG6_16_114PL & MG6_16_115PL & MG6_16_116PL)
// End of MG6_16:


//
// Automatically generate PIEIER7 interrupt masks MG71 to MG716:
//

// Beginning of MG71:
#if (G7_2PL >= G7_1PL) || (G7_2PL == 0)
#define  MG7_1_12PL    ~(1 << 1)
#else
#define  MG7_1_12PL    0xFFFF
#endif

