TexasInstruments/c2000ware-core-sdk/device_support/f28004x/examples/boostxl_afe031_f28004x_dacmode/boostxl_afe031_f28004x_dacmode_isr.h
#if (G9_7PL >= G9_16PL) || (G9_7PL == 0)
#define  MG9_16_17PL    ~(1 << 6)
#else
#define  MG9_16_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_16PL) || (G9_8PL == 0)
#define  MG9_16_18PL    ~(1 << 7)
#else
#define  MG9_16_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_16PL) || (G9_9PL == 0)
#define  MG9_16_19PL    ~(1 << 8)
#else
#define  MG9_16_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_16PL) || (G9_10PL == 0)
#define  MG9_16_110PL    ~(1 << 9)
#else
#define  MG9_16_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_16PL) || (G9_11PL == 0)
#define  MG9_16_111PL    ~(1 << 10)
#else
#define  MG9_16_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_16PL) || (G9_12PL == 0)
#define  MG9_16_112PL    ~(1 << 11)
#else
#define  MG9_16_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_16PL) || (G9_13PL == 0)
#define  MG9_16_113PL    ~(1 << 12)
#else
#define  MG9_16_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_16PL) || (G9_14PL == 0)
#define  MG9_16_114PL    ~(1 << 13)
#else
#define  MG9_16_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_16PL) || (G9_15PL == 0)
#define  MG9_16_115PL    ~(1 << 14)
#else
#define  MG9_16_115PL    0xFFFF
#endif

#define  MG9_16_116PL	0x7FFF
#define  MG9_16    (MG9_16_11PL & MG9_16_12PL & MG9_16_13PL & MG9_16_14PL & \
                    MG9_16_15PL & MG9_16_16PL & MG9_16_17PL & MG9_16_18PL & \
                    MG9_16_19PL & MG9_16_110PL & MG9_16_111PL & MG9_16_112PL & \
                    MG9_16_113PL & MG9_16_114PL & MG9_16_115PL & MG9_16_116PL)
// End of MG9_16:


//
// Automatically generate PIEIER10 interrupt masks MG101 to MG1016:
//

// Beginning of MG101:
#if (G10_2PL >= G10_1PL) || (G10_2PL == 0)
#define  MG10_1_12PL    ~(1 << 1)
#else
#define  MG10_1_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_1PL) || (G10_3PL == 0)
#define  MG10_1_13PL    ~(1 << 2)
#else
#define  MG10_1_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_1PL) || (G10_4PL == 0)
#define  MG10_1_14PL    ~(1 << 3)
#else
#define  MG10_1_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_1PL) || (G10_5PL == 0)
#define  MG10_1_15PL    ~(1 << 4)
#else
#define  MG10_1_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_1PL) || (G10_6PL == 0)
#define  MG10_1_16PL    ~(1 << 5)
#else
#define  MG10_1_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_1PL) || (G10_7PL == 0)
#define  MG10_1_17PL    ~(1 << 6)
#else
#define  MG10_1_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_1PL) || (G10_8PL == 0)
#define  MG10_1_18PL    ~(1 << 7)
#else
#define  MG10_1_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_1PL) || (G10_9PL == 0)
#define  MG10_1_19PL    ~(1 << 8)
#else
#define  MG10_1_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_1PL) || (G10_10PL == 0)
#define  MG10_1_110PL    ~(1 << 9)
#else
#define  MG10_1_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_1PL) || (G10_11PL == 0)
#define  MG10_1_111PL    ~(1 << 10)
#else
#define  MG10_1_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_1PL) || (G10_12PL == 0)
#define  MG10_1_112PL    ~(1 << 11)
#else
#define  MG10_1_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_1PL) || (G10_13PL == 0)
#define  MG10_1_113PL    ~(1 << 12)
#else
#define  MG10_1_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_1PL) || (G10_14PL == 0)
#define  MG10_1_114PL    ~(1 << 13)
#else
#define  MG10_1_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_1PL) || (G10_15PL == 0)
#define  MG10_1_115PL    ~(1 << 14)
#else
#define  MG10_1_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_1PL) || (G10_16PL == 0)
#define  MG10_1_116PL    ~(1 << 15)
#else
#define  MG10_1_116PL    0xFFFF
#endif

#define  MG10_1_11PL	0xFFFE
#define  MG10_1    (MG10_1_11PL & MG10_1_12PL & MG10_1_13PL & MG10_1_14PL & \
                    MG10_1_15PL & MG10_1_16PL & MG10_1_17PL & MG10_1_18PL & \
                    MG10_1_19PL & MG10_1_110PL & MG10_1_111PL & MG10_1_112PL & \
                    MG10_1_113PL & MG10_1_114PL & MG10_1_115PL & MG10_1_116PL)
// End of MG10_1:
// Beginning of MG102:
#if (G10_1PL >= G10_2PL) || (G10_1PL == 0)
#define  MG10_2_11PL    ~(1 << 0)
#else
#define  MG10_2_11PL    0xFFFF
#endif

#if (G10_3PL >= G10_2PL) || (G10_3PL == 0)
#define  MG10_2_13PL    ~(1 << 2)
#else
#define  MG10_2_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_2PL) || (G10_4PL == 0)
#define  MG10_2_14PL    ~(1 << 3)
#else
#define  MG10_2_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_2PL) || (G10_5PL == 0)
#define  MG10_2_15PL    ~(1 << 4)
#else
#define  MG10_2_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_2PL) || (G10_6PL == 0)
#define  MG10_2_16PL    ~(1 << 5)
#else
#define  MG10_2_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_2PL) || (G10_7PL == 0)
#define  MG10_2_17PL    ~(1 << 6)
#else
#define  MG10_2_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_2PL) || (G10_8PL == 0)
#define  MG10_2_18PL    ~(1 << 7)
#else
#define  MG10_2_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_2PL) || (G10_9PL == 0)
#define  MG10_2_19PL    ~(1 << 8)
#else
#define  MG10_2_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_2PL) || (G10_10PL == 0)
#define  MG10_2_110PL    ~(1 << 9)
#else
#define  MG10_2_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_2PL) || (G10_11PL == 0)
#define  MG10_2_111PL    ~(1 << 10)
#else
#define  MG10_2_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_2PL) || (G10_12PL == 0)
#define  MG10_2_112PL    ~(1 << 11)
#else
#define  MG10_2_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_2PL) || (G10_13PL == 0)
#define  MG10_2_113PL    ~(1 << 12)
#else
#define  MG10_2_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_2PL) || (G10_14PL == 0)
#define  MG10_2_114PL    ~(1 << 13)
#else
#define  MG10_2_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_2PL) || (G10_15PL == 0)
#define  MG10_2_115PL    ~(1 << 14)
#else
#define  MG10_2_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_2PL) || (G10_16PL == 0)
#define  MG10_2_116PL    ~(1 << 15)
#else
#define  MG10_2_116PL    0xFFFF
#endif

#define  MG10_2_12PL	0xFFFD
#define  MG10_2    (MG10_2_11PL & MG10_2_12PL & MG10_2_13PL & MG10_2_14PL & \
                    MG10_2_15PL & MG10_2_16PL & MG10_2_17PL & MG10_2_18PL & \
                    MG10_2_19PL & MG10_2_110PL & MG10_2_111PL & MG10_2_112PL & \
                    MG10_2_113PL & MG10_2_114PL & MG10_2_115PL & MG10_2_116PL)
// End of MG10_2:
// Beginning of MG103:
#if (G10_1PL >= G10_3PL) || (G10_1PL == 0)
#define  MG10_3_11PL    ~(1 << 0)
#else
#define  MG10_3_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_3PL) || (G10_2PL == 0)
#define  MG10_3_12PL    ~(1 << 1)
#else
#define  MG10_3_12PL    0xFFFF
#endif

#if (G10_4PL >= G10_3PL) || (G10_4PL == 0)
#define  MG10_3_14PL    ~(1 << 3)
#else
#define  MG10_3_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_3PL) || (G10_5PL == 0)
#define  MG10_3_15PL    ~(1 << 4)
#else
#define  MG10_3_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_3PL) || (G10_6PL == 0)
#define  MG10_3_16PL    ~(1 << 5)
#else
#define  MG10_3_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_3PL) || (G10_7PL == 0)
#define  MG10_3_17PL    ~(1 << 6)
#else
#define  MG10_3_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_3PL) || (G10_8PL == 0)
#define  MG10_3_18PL    ~(1 << 7)
#else
#define  MG10_3_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_3PL) || (G10_9PL == 0)
#define  MG10_3_19PL    ~(1 << 8)
#else
#define  MG10_3_19PL    0xFFFF
#endif

