TexasInstruments/c2000ware-core-sdk/device_support/f28004x/examples/boostxl_afe031_f28004x_dacmode/boostxl_afe031_f28004x_dacmode_isr.h
#if (G10_13PL >= G10_6PL) || (G10_13PL == 0)
#define  MG10_6_113PL    ~(1 << 12)
#else
#define  MG10_6_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_6PL) || (G10_14PL == 0)
#define  MG10_6_114PL    ~(1 << 13)
#else
#define  MG10_6_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_6PL) || (G10_15PL == 0)
#define  MG10_6_115PL    ~(1 << 14)
#else
#define  MG10_6_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_6PL) || (G10_16PL == 0)
#define  MG10_6_116PL    ~(1 << 15)
#else
#define  MG10_6_116PL    0xFFFF
#endif

#define  MG10_6_16PL	0xFFDF
#define  MG10_6    (MG10_6_11PL & MG10_6_12PL & MG10_6_13PL & MG10_6_14PL & \
                    MG10_6_15PL & MG10_6_16PL & MG10_6_17PL & MG10_6_18PL & \
                    MG10_6_19PL & MG10_6_110PL & MG10_6_111PL & MG10_6_112PL & \
                    MG10_6_113PL & MG10_6_114PL & MG10_6_115PL & MG10_6_116PL)
// End of MG10_6:
// Beginning of MG107:
#if (G10_1PL >= G10_7PL) || (G10_1PL == 0)
#define  MG10_7_11PL    ~(1 << 0)
#else
#define  MG10_7_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_7PL) || (G10_2PL == 0)
#define  MG10_7_12PL    ~(1 << 1)
#else
#define  MG10_7_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_7PL) || (G10_3PL == 0)
#define  MG10_7_13PL    ~(1 << 2)
#else
#define  MG10_7_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_7PL) || (G10_4PL == 0)
#define  MG10_7_14PL    ~(1 << 3)
#else
#define  MG10_7_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_7PL) || (G10_5PL == 0)
#define  MG10_7_15PL    ~(1 << 4)
#else
#define  MG10_7_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_7PL) || (G10_6PL == 0)
#define  MG10_7_16PL    ~(1 << 5)
#else
#define  MG10_7_16PL    0xFFFF
#endif

#if (G10_8PL >= G10_7PL) || (G10_8PL == 0)
#define  MG10_7_18PL    ~(1 << 7)
#else
#define  MG10_7_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_7PL) || (G10_9PL == 0)
#define  MG10_7_19PL    ~(1 << 8)
#else
#define  MG10_7_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_7PL) || (G10_10PL == 0)
#define  MG10_7_110PL    ~(1 << 9)
#else
#define  MG10_7_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_7PL) || (G10_11PL == 0)
#define  MG10_7_111PL    ~(1 << 10)
#else
#define  MG10_7_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_7PL) || (G10_12PL == 0)
#define  MG10_7_112PL    ~(1 << 11)
#else
#define  MG10_7_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_7PL) || (G10_13PL == 0)
#define  MG10_7_113PL    ~(1 << 12)
#else
#define  MG10_7_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_7PL) || (G10_14PL == 0)
#define  MG10_7_114PL    ~(1 << 13)
#else
#define  MG10_7_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_7PL) || (G10_15PL == 0)
#define  MG10_7_115PL    ~(1 << 14)
#else
#define  MG10_7_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_7PL) || (G10_16PL == 0)
#define  MG10_7_116PL    ~(1 << 15)
#else
#define  MG10_7_116PL    0xFFFF
#endif

#define  MG10_7_17PL	0xFFBF
#define  MG10_7    (MG10_7_11PL & MG10_7_12PL & MG10_7_13PL & MG10_7_14PL & \
                    MG10_7_15PL & MG10_7_16PL & MG10_7_17PL & MG10_7_18PL & \
                    MG10_7_19PL & MG10_7_110PL & MG10_7_111PL & MG10_7_112PL & \
                    MG10_7_113PL & MG10_7_114PL & MG10_7_115PL & MG10_7_116PL)
// End of MG10_7:
// Beginning of MG108:
#if (G10_1PL >= G10_8PL) || (G10_1PL == 0)
#define  MG10_8_11PL    ~(1 << 0)
#else
#define  MG10_8_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_8PL) || (G10_2PL == 0)
#define  MG10_8_12PL    ~(1 << 1)
#else
#define  MG10_8_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_8PL) || (G10_3PL == 0)
#define  MG10_8_13PL    ~(1 << 2)
#else
#define  MG10_8_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_8PL) || (G10_4PL == 0)
#define  MG10_8_14PL    ~(1 << 3)
#else
#define  MG10_8_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_8PL) || (G10_5PL == 0)
#define  MG10_8_15PL    ~(1 << 4)
#else
#define  MG10_8_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_8PL) || (G10_6PL == 0)
#define  MG10_8_16PL    ~(1 << 5)
#else
#define  MG10_8_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_8PL) || (G10_7PL == 0)
#define  MG10_8_17PL    ~(1 << 6)
#else
#define  MG10_8_17PL    0xFFFF
#endif

#if (G10_9PL >= G10_8PL) || (G10_9PL == 0)
#define  MG10_8_19PL    ~(1 << 8)
#else
#define  MG10_8_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_8PL) || (G10_10PL == 0)
#define  MG10_8_110PL    ~(1 << 9)
#else
#define  MG10_8_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_8PL) || (G10_11PL == 0)
#define  MG10_8_111PL    ~(1 << 10)
#else
#define  MG10_8_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_8PL) || (G10_12PL == 0)
#define  MG10_8_112PL    ~(1 << 11)
#else
#define  MG10_8_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_8PL) || (G10_13PL == 0)
#define  MG10_8_113PL    ~(1 << 12)
#else
#define  MG10_8_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_8PL) || (G10_14PL == 0)
#define  MG10_8_114PL    ~(1 << 13)
#else
#define  MG10_8_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_8PL) || (G10_15PL == 0)
#define  MG10_8_115PL    ~(1 << 14)
#else
#define  MG10_8_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_8PL) || (G10_16PL == 0)
#define  MG10_8_116PL    ~(1 << 15)
#else
#define  MG10_8_116PL    0xFFFF
#endif

#define  MG10_8_18PL	0xFF7F
#define  MG10_8    (MG10_8_11PL & MG10_8_12PL & MG10_8_13PL & MG10_8_14PL & \
                    MG10_8_15PL & MG10_8_16PL & MG10_8_17PL & MG10_8_18PL & \
                    MG10_8_19PL & MG10_8_110PL & MG10_8_111PL & MG10_8_112PL & \
                    MG10_8_113PL & MG10_8_114PL & MG10_8_115PL & MG10_8_116PL)
// End of MG10_8:
// Beginning of MG109:
#if (G10_1PL >= G10_9PL) || (G10_1PL == 0)
#define  MG10_9_11PL    ~(1 << 0)
#else
#define  MG10_9_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_9PL) || (G10_2PL == 0)
#define  MG10_9_12PL    ~(1 << 1)
#else
#define  MG10_9_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_9PL) || (G10_3PL == 0)
#define  MG10_9_13PL    ~(1 << 2)
#else
#define  MG10_9_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_9PL) || (G10_4PL == 0)
#define  MG10_9_14PL    ~(1 << 3)
#else
#define  MG10_9_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_9PL) || (G10_5PL == 0)
#define  MG10_9_15PL    ~(1 << 4)
#else
#define  MG10_9_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_9PL) || (G10_6PL == 0)
#define  MG10_9_16PL    ~(1 << 5)
#else
#define  MG10_9_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_9PL) || (G10_7PL == 0)
#define  MG10_9_17PL    ~(1 << 6)
#else
#define  MG10_9_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_9PL) || (G10_8PL == 0)
#define  MG10_9_18PL    ~(1 << 7)
#else
#define  MG10_9_18PL    0xFFFF
#endif

#if (G10_10PL >= G10_9PL) || (G10_10PL == 0)
#define  MG10_9_110PL    ~(1 << 9)
#else
#define  MG10_9_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_9PL) || (G10_11PL == 0)
#define  MG10_9_111PL    ~(1 << 10)
#else
#define  MG10_9_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_9PL) || (G10_12PL == 0)
#define  MG10_9_112PL    ~(1 << 11)
#else
#define  MG10_9_112PL    0xFFFF
#endif

