TexasInstruments/c2000ware-core-sdk/device_support/f28004x/examples/boostxl_afe031_f28004x_dacmode/boostxl_afe031_f28004x_dacmode_isr.h
#if (G11_3PL >= G11_11PL) || (G11_3PL == 0)
#define  MG11_11_13PL    ~(1 << 2)
#else
#define  MG11_11_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_11PL) || (G11_4PL == 0)
#define  MG11_11_14PL    ~(1 << 3)
#else
#define  MG11_11_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_11PL) || (G11_5PL == 0)
#define  MG11_11_15PL    ~(1 << 4)
#else
#define  MG11_11_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_11PL) || (G11_6PL == 0)
#define  MG11_11_16PL    ~(1 << 5)
#else
#define  MG11_11_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_11PL) || (G11_7PL == 0)
#define  MG11_11_17PL    ~(1 << 6)
#else
#define  MG11_11_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_11PL) || (G11_8PL == 0)
#define  MG11_11_18PL    ~(1 << 7)
#else
#define  MG11_11_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_11PL) || (G11_9PL == 0)
#define  MG11_11_19PL    ~(1 << 8)
#else
#define  MG11_11_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_11PL) || (G11_10PL == 0)
#define  MG11_11_110PL    ~(1 << 9)
#else
#define  MG11_11_110PL    0xFFFF
#endif

#if (G11_12PL >= G11_11PL) || (G11_12PL == 0)
#define  MG11_11_112PL    ~(1 << 11)
#else
#define  MG11_11_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_11PL) || (G11_13PL == 0)
#define  MG11_11_113PL    ~(1 << 12)
#else
#define  MG11_11_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_11PL) || (G11_14PL == 0)
#define  MG11_11_114PL    ~(1 << 13)
#else
#define  MG11_11_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_11PL) || (G11_15PL == 0)
#define  MG11_11_115PL    ~(1 << 14)
#else
#define  MG11_11_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_11PL) || (G11_16PL == 0)
#define  MG11_11_116PL    ~(1 << 15)
#else
#define  MG11_11_116PL    0xFFFF
#endif

#define  MG11_11_111PL	0xFBFF
#define  MG11_11    (MG11_11_11PL & MG11_11_12PL & MG11_11_13PL & MG11_11_14PL & \
                    MG11_11_15PL & MG11_11_16PL & MG11_11_17PL & MG11_11_18PL & \
                    MG11_11_19PL & MG11_11_110PL & MG11_11_111PL & MG11_11_112PL & \
                    MG11_11_113PL & MG11_11_114PL & MG11_11_115PL & MG11_11_116PL)
// End of MG11_11:
// Beginning of MG1112:
#if (G11_1PL >= G11_12PL) || (G11_1PL == 0)
#define  MG11_12_11PL    ~(1 << 0)
#else
#define  MG11_12_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_12PL) || (G11_2PL == 0)
#define  MG11_12_12PL    ~(1 << 1)
#else
#define  MG11_12_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_12PL) || (G11_3PL == 0)
#define  MG11_12_13PL    ~(1 << 2)
#else
#define  MG11_12_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_12PL) || (G11_4PL == 0)
#define  MG11_12_14PL    ~(1 << 3)
#else
#define  MG11_12_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_12PL) || (G11_5PL == 0)
#define  MG11_12_15PL    ~(1 << 4)
#else
#define  MG11_12_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_12PL) || (G11_6PL == 0)
#define  MG11_12_16PL    ~(1 << 5)
#else
#define  MG11_12_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_12PL) || (G11_7PL == 0)
#define  MG11_12_17PL    ~(1 << 6)
#else
#define  MG11_12_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_12PL) || (G11_8PL == 0)
#define  MG11_12_18PL    ~(1 << 7)
#else
#define  MG11_12_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_12PL) || (G11_9PL == 0)
#define  MG11_12_19PL    ~(1 << 8)
#else
#define  MG11_12_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_12PL) || (G11_10PL == 0)
#define  MG11_12_110PL    ~(1 << 9)
#else
#define  MG11_12_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_12PL) || (G11_11PL == 0)
#define  MG11_12_111PL    ~(1 << 10)
#else
#define  MG11_12_111PL    0xFFFF
#endif

#if (G11_13PL >= G11_12PL) || (G11_13PL == 0)
#define  MG11_12_113PL    ~(1 << 12)
#else
#define  MG11_12_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_12PL) || (G11_14PL == 0)
#define  MG11_12_114PL    ~(1 << 13)
#else
#define  MG11_12_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_12PL) || (G11_15PL == 0)
#define  MG11_12_115PL    ~(1 << 14)
#else
#define  MG11_12_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_12PL) || (G11_16PL == 0)
#define  MG11_12_116PL    ~(1 << 15)
#else
#define  MG11_12_116PL    0xFFFF
#endif

#define  MG11_12_112PL	0xF7FF
#define  MG11_12    (MG11_12_11PL & MG11_12_12PL & MG11_12_13PL & MG11_12_14PL & \
                    MG11_12_15PL & MG11_12_16PL & MG11_12_17PL & MG11_12_18PL & \
                    MG11_12_19PL & MG11_12_110PL & MG11_12_111PL & MG11_12_112PL & \
                    MG11_12_113PL & MG11_12_114PL & MG11_12_115PL & MG11_12_116PL)
// End of MG11_12:
// Beginning of MG1113:
#if (G11_1PL >= G11_13PL) || (G11_1PL == 0)
#define  MG11_13_11PL    ~(1 << 0)
#else
#define  MG11_13_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_13PL) || (G11_2PL == 0)
#define  MG11_13_12PL    ~(1 << 1)
#else
#define  MG11_13_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_13PL) || (G11_3PL == 0)
#define  MG11_13_13PL    ~(1 << 2)
#else
#define  MG11_13_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_13PL) || (G11_4PL == 0)
#define  MG11_13_14PL    ~(1 << 3)
#else
#define  MG11_13_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_13PL) || (G11_5PL == 0)
#define  MG11_13_15PL    ~(1 << 4)
#else
#define  MG11_13_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_13PL) || (G11_6PL == 0)
#define  MG11_13_16PL    ~(1 << 5)
#else
#define  MG11_13_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_13PL) || (G11_7PL == 0)
#define  MG11_13_17PL    ~(1 << 6)
#else
#define  MG11_13_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_13PL) || (G11_8PL == 0)
#define  MG11_13_18PL    ~(1 << 7)
#else
#define  MG11_13_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_13PL) || (G11_9PL == 0)
#define  MG11_13_19PL    ~(1 << 8)
#else
#define  MG11_13_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_13PL) || (G11_10PL == 0)
#define  MG11_13_110PL    ~(1 << 9)
#else
#define  MG11_13_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_13PL) || (G11_11PL == 0)
#define  MG11_13_111PL    ~(1 << 10)
#else
#define  MG11_13_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_13PL) || (G11_12PL == 0)
#define  MG11_13_112PL    ~(1 << 11)
#else
#define  MG11_13_112PL    0xFFFF
#endif

#if (G11_14PL >= G11_13PL) || (G11_14PL == 0)
#define  MG11_13_114PL    ~(1 << 13)
#else
#define  MG11_13_114PL    0xFFFF
#endif

