TexasInstruments/c2000ware-core-sdk/device_support/f28004x/examples/boostxl_afe031_f28004x_dacmode/boostxl_afe031_f28004x_dacmode_isr.h
#if (G11_15PL >= G11_13PL) || (G11_15PL == 0)
#define  MG11_13_115PL    ~(1 << 14)
#else
#define  MG11_13_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_13PL) || (G11_16PL == 0)
#define  MG11_13_116PL    ~(1 << 15)
#else
#define  MG11_13_116PL    0xFFFF
#endif

#define  MG11_13_113PL	0xEFFF
#define  MG11_13    (MG11_13_11PL & MG11_13_12PL & MG11_13_13PL & MG11_13_14PL & \
                    MG11_13_15PL & MG11_13_16PL & MG11_13_17PL & MG11_13_18PL & \
                    MG11_13_19PL & MG11_13_110PL & MG11_13_111PL & MG11_13_112PL & \
                    MG11_13_113PL & MG11_13_114PL & MG11_13_115PL & MG11_13_116PL)
// End of MG11_13:
// Beginning of MG1114:
#if (G11_1PL >= G11_14PL) || (G11_1PL == 0)
#define  MG11_14_11PL    ~(1 << 0)
#else
#define  MG11_14_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_14PL) || (G11_2PL == 0)
#define  MG11_14_12PL    ~(1 << 1)
#else
#define  MG11_14_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_14PL) || (G11_3PL == 0)
#define  MG11_14_13PL    ~(1 << 2)
#else
#define  MG11_14_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_14PL) || (G11_4PL == 0)
#define  MG11_14_14PL    ~(1 << 3)
#else
#define  MG11_14_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_14PL) || (G11_5PL == 0)
#define  MG11_14_15PL    ~(1 << 4)
#else
#define  MG11_14_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_14PL) || (G11_6PL == 0)
#define  MG11_14_16PL    ~(1 << 5)
#else
#define  MG11_14_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_14PL) || (G11_7PL == 0)
#define  MG11_14_17PL    ~(1 << 6)
#else
#define  MG11_14_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_14PL) || (G11_8PL == 0)
#define  MG11_14_18PL    ~(1 << 7)
#else
#define  MG11_14_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_14PL) || (G11_9PL == 0)
#define  MG11_14_19PL    ~(1 << 8)
#else
#define  MG11_14_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_14PL) || (G11_10PL == 0)
#define  MG11_14_110PL    ~(1 << 9)
#else
#define  MG11_14_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_14PL) || (G11_11PL == 0)
#define  MG11_14_111PL    ~(1 << 10)
#else
#define  MG11_14_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_14PL) || (G11_12PL == 0)
#define  MG11_14_112PL    ~(1 << 11)
#else
#define  MG11_14_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_14PL) || (G11_13PL == 0)
#define  MG11_14_113PL    ~(1 << 12)
#else
#define  MG11_14_113PL    0xFFFF
#endif

#if (G11_15PL >= G11_14PL) || (G11_15PL == 0)
#define  MG11_14_115PL    ~(1 << 14)
#else
#define  MG11_14_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_14PL) || (G11_16PL == 0)
#define  MG11_14_116PL    ~(1 << 15)
#else
#define  MG11_14_116PL    0xFFFF
#endif

#define  MG11_14_114PL	0xDFFF
#define  MG11_14    (MG11_14_11PL & MG11_14_12PL & MG11_14_13PL & MG11_14_14PL & \
                    MG11_14_15PL & MG11_14_16PL & MG11_14_17PL & MG11_14_18PL & \
                    MG11_14_19PL & MG11_14_110PL & MG11_14_111PL & MG11_14_112PL & \
                    MG11_14_113PL & MG11_14_114PL & MG11_14_115PL & MG11_14_116PL)
// End of MG11_14:
// Beginning of MG1115:
#if (G11_1PL >= G11_15PL) || (G11_1PL == 0)
#define  MG11_15_11PL    ~(1 << 0)
#else
#define  MG11_15_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_15PL) || (G11_2PL == 0)
#define  MG11_15_12PL    ~(1 << 1)
#else
#define  MG11_15_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_15PL) || (G11_3PL == 0)
#define  MG11_15_13PL    ~(1 << 2)
#else
#define  MG11_15_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_15PL) || (G11_4PL == 0)
#define  MG11_15_14PL    ~(1 << 3)
#else
#define  MG11_15_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_15PL) || (G11_5PL == 0)
#define  MG11_15_15PL    ~(1 << 4)
#else
#define  MG11_15_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_15PL) || (G11_6PL == 0)
#define  MG11_15_16PL    ~(1 << 5)
#else
#define  MG11_15_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_15PL) || (G11_7PL == 0)
#define  MG11_15_17PL    ~(1 << 6)
#else
#define  MG11_15_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_15PL) || (G11_8PL == 0)
#define  MG11_15_18PL    ~(1 << 7)
#else
#define  MG11_15_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_15PL) || (G11_9PL == 0)
#define  MG11_15_19PL    ~(1 << 8)
#else
#define  MG11_15_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_15PL) || (G11_10PL == 0)
#define  MG11_15_110PL    ~(1 << 9)
#else
#define  MG11_15_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_15PL) || (G11_11PL == 0)
#define  MG11_15_111PL    ~(1 << 10)
#else
#define  MG11_15_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_15PL) || (G11_12PL == 0)
#define  MG11_15_112PL    ~(1 << 11)
#else
#define  MG11_15_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_15PL) || (G11_13PL == 0)
#define  MG11_15_113PL    ~(1 << 12)
#else
#define  MG11_15_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_15PL) || (G11_14PL == 0)
#define  MG11_15_114PL    ~(1 << 13)
#else
#define  MG11_15_114PL    0xFFFF
#endif

#if (G11_16PL >= G11_15PL) || (G11_16PL == 0)
#define  MG11_15_116PL    ~(1 << 15)
#else
#define  MG11_15_116PL    0xFFFF
#endif

#define  MG11_15_115PL	0xBFFF
#define  MG11_15    (MG11_15_11PL & MG11_15_12PL & MG11_15_13PL & MG11_15_14PL & \
                    MG11_15_15PL & MG11_15_16PL & MG11_15_17PL & MG11_15_18PL & \
                    MG11_15_19PL & MG11_15_110PL & MG11_15_111PL & MG11_15_112PL & \
                    MG11_15_113PL & MG11_15_114PL & MG11_15_115PL & MG11_15_116PL)
// End of MG11_15:
// Beginning of MG1116:
#if (G11_1PL >= G11_16PL) || (G11_1PL == 0)
#define  MG11_16_11PL    ~(1 << 0)
#else
#define  MG11_16_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_16PL) || (G11_2PL == 0)
#define  MG11_16_12PL    ~(1 << 1)
#else
#define  MG11_16_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_16PL) || (G11_3PL == 0)
#define  MG11_16_13PL    ~(1 << 2)
#else
#define  MG11_16_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_16PL) || (G11_4PL == 0)
#define  MG11_16_14PL    ~(1 << 3)
#else
#define  MG11_16_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_16PL) || (G11_5PL == 0)
#define  MG11_16_15PL    ~(1 << 4)
#else
#define  MG11_16_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_16PL) || (G11_6PL == 0)
#define  MG11_16_16PL    ~(1 << 5)
#else
#define  MG11_16_16PL    0xFFFF
#endif

